I am having the same issue with Terraform, any help would be appreciated. I've noticed that this problem does not occur in version 1.11.1, but it does in 12.0.x. Here's the code snippet where the issue appears:

```terraform
  # mongodbatlas_project_ip_access_list.mongodb-peering-gcp-whitelist-subnet_ip_primary_platform must be replaced
-/+ resource "mongodbatlas_project_ip_access_list" "mongodb-peering-gcp-whitelist-subnet_ip_primary_platform" {
      + aws_security_group = (known after apply) # forces replacement
      ~ id                 = "xxx" -> (known after apply)
      + ip_address         = (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
      - timeouts {}
    }
```

Does anyone have insights on why this replacement is forced in the newer version?



